{"Notes":{
    "April 2, 2018" : "Git seems to not show all my contributions (I am not sure.) so I will put the dates on when I put notes here so that everybody knows that I actually do everyday.",
    "April 3, 2018" :[
        "These are useless random notes. I might make another file that would have some important medical based notes but that'll probably be next month. So, you'll have to bear with this unless you can just go to the other file right now.",
        "I'm an otaku... But a small one. My mom keeps me away from most anime (idk why) so I try to just watch the very 'kid-friendly' anime. I got a new manga on the last day of March! It was my very first."
    ], 
    "April 4, 2018" :{
        "Health" :{
            "Sleep": "Do you know what time you go to sleep? Are you tired in the morning? Well I am tired and unknowing of the time I sleep so I put this here to remind me to always go to sleep at 10:00pm. What time do you go to sleep?",
            "Excercise" : "I never excercise. Do you? I heard it's good to do it way early in the morning. Like maybe 4:00am. Why? Most oxygen is out at that time and less car smog. Also, your body is warm so it's easier to stretch! I hope you like my advice."
        }
    },
    "April 5, 2018" :{
        "Science Questions":[
            "Everything is made up of atoms. Right? Tecnically it's possible that right now small parts of you are... Teleporting, right now.",
            "Is it possible to disappear? If you didn't know you existed, if nobody else knew you existed... Could you disappear?",
            "Is it possible to travel in time, right now?", 
            "Are their people from the future, that you think are just normal people?", 
            "If people from the future could travel in time by taking somebody's body over, what happens to the mind of the person before?",
            "Are you from the future?",
            "What would you do if you could travel back in time and change everything?",
            "What does an atom look like?",
            "Can people right now teleport?",
            "Is your arm you? Or is it your property?",
            "If we are made up of atoms... Are they solid? Are we even solid?",
            "What size are we really? If we took out all the space inbetween the electron and a photon in an atom... What size would we be?"
        ],
        "Small Joke" : "Don't trust atom. He makes up everything!"
    },
    "April 6, 2018" :{
        "random note" : "Git finally got my contributions to work I guess, but I'm still going to put the date. Today's note isnt really interesting.",
        "Arts" : "So, I have a hobby of doing art, and I post on instagram, sometimes on DeviantArt. That's about it."
    }
 }
}