{"Notes":{
    "April 2, 2018" : "Git seems to not show all my contributions (I am not sure.) so I will put the dates on when I put notes here so that everybody knows that I actually do everyday.",
    "April 3, 2018" :[
        "These are useless random notes. I might make another file that would have some important medical based notes but that'll probably be next month. So, you'll have to bear with this unless you can just go to the other file right now.",
        "I'm an otaku... But a small one. My mom keeps me away from most anime (idk why) so I try to just watch the very 'kid-friendly' anime. I got a new manga on the last day of March! It was my very first."
    ], 
    "April 4, 2018" :{
        "Health" :{
            "Sleep": "Do you know what time you go to sleep? Are you tired in the morning? Well I am tired and unknowing of the time I sleep so I put this here to remind me to always go to sleep at 10:00pm. What time do you go to sleep?",
            "Excercise" : "I never excercise. Do you? I heard it's good to do it way early in the morning. Like maybe 4:00am. Why? Most oxygen is out at that time and less car smog. Also, your body is warm so it's easier to stretch! I hope you like my advice."
        }
    },
    "April 5, 2018" :{
        "Science Questions":[
            "Everything is made up of atoms. Right? Tecnically it's possible that right now small parts of you are... Teleporting, right now.",
            "Is it possible to disappear? If you didn't know you existed, if nobody else knew you existed... Could you disappear?",
            "Is it possible to travel in time, right now?", 
            "Are their people from the future, that you think are just normal people?", 
            "If people from the future could travel in time by taking somebody's body over, what happens to the mind of the person before?",
            "Are you from the future?",
            "What would you do if you could travel back in time and change everything?",
            "What does an atom look like?",
            "Can people right now teleport?",
            "Is your arm you? Or is it your property?",
            "If we are made up of atoms... Are they solid? Are we even solid?",
            "What size are we really? If we took out all the space inbetween the electron and a photon in an atom... What size would we be?"
        ],
        "Small Joke" : "Don't trust atom. He makes up everything!"
    },
    "April 6, 2018" :{
        "random note" : "Git finally got my contributions to work I guess, but I'm still going to put the date. Today's note isnt really interesting.",
        "Arts" : "So, I have a hobby of doing art, and I post on instagram, sometimes on DeviantArt. That's about it."
    },
    "April 9, 2018" :{
        "Focus" : "I... Have horrible focus. Do you have good focus? I learned focus mostly comes from testosterone, which is mostly in male humans. Isn't that interesting? But I also heard there was a chemical called estrogen (idk how to spell it) that is most commonly in females. It's like a lie detector.",
        "Work" : "I have a huge art block and I can barely even do my work ;-; I can't even read a book I want to because I just want to play an online game ;-; Does anybody have some kind of technique for focus? Please let me know!",
        "Centralized Workflow" :[
            "There is no 'one-size-fits-all' kind of workflow",
            "A workflow should be simple and make your team more productive",
            "Your business needs should help shape your git workflow"
        ],
        "Feature Branch Workflow" :[
            "This workflow helps organize and track branches that are focused on business domain feature sets other git workflows are repo foocused.",
            "Focused on branching patterns",
            "Can be leveraged by other repo oriented workflows",
            "Promotes collaboriation with team members through pull requests and merge reviews"
        ],
        "Gitflow Workflow" :[
            "1. A develop branch is created from master", "2. a release branch is created from develop", "3. Feature branches are created from develop", "4.When a feature is complete it is merged into the develop branch", "5. When the release branche is done it is merged into develop and master", "6.If an issue in master is detected a hotfix branch is created from master", "7.Once the hotfix is complete it is merged to both develop and master",
            "The workflow is great for a release-based software workflow",
            "Gitflow offers a dedicated channel for hotfixes to production"
        ]
    },
    "April 10, 2018":{
        "Blocked": "I have an art block... Work/Focus block... Writers Block... and a creative block. I can barely do anything... At all. I can't focus... I can't even play a video game ;-; Please help somebody."
    },
    "April 11, 2018":{
        "Time Travel" : "Do you think we'll be able to time travel? I think if we time traveled, we'd be stuck there since we can't bring things from the future. I also think that if you were existent at the time you traveled to, you'll take over that body. What would you do if you could time travel?",
        "Drawing Wishlist" :[
            "Microsoft Surface Pen - stylus - Bluetooth 4.0 - black",
            "Wacom Intuos Small/CTL-4100, CTL-4100WL(Bluetooth model)",
            "Sketchbook Autodesk Pro Subscription"
        ]
    },
    "April 12, 2018":{
        "Preferred colleges" :[
            "UCSD - University California San Diego",
            "PLNU - Point Loma Nazarene University",
            "Stanford University School of Medicine"
        ]
    },
    "April 13, 2018" : "I made the medical notes file today! I'll edit it every once a week. Probably on Fridays or Wednesdays.",
    "April 16, 2018" :{
        "Space" : "If we're ever able to land on another planet, that's suitable for human beings, do you think some sort of human like animal would be there? Or maybe some kind of animal. Or maybe do you think that their could be an alien that's already exploring space? Is it even possible?"
    },
    "April 17,2018" : "I don't really have any notes for this except I made two new files for a website. I'll also maybe make a website template.",
    "April 18,2018" : "I am working on a repository called college by Jun Alvarado. I am collaborating with Lu Alva and Jun Alvarado for this repository. I suggest you should check it out.",
    "April 19,2018" : "I am going to be working on the website template and other repository more than these notes so I will barely ever go on important notes, but i'll still try to make notes on here. This is just a small update.",
    "April 20,2018" : "I am going to change my website template to my own website, I'll create a template after finishing mine. I will not be posting a lot of notes on here but I will be using college repository a lot.",
    "April 23,2018" : "As you may have suspected if anybody even reads this is that I don't have great notes to put here. If you are looking for medical based notes head onto the file important-notes.json. If you are looking for college based things than head on over to https://github.com/jun3rd/college . I do have one small note to make, though. If you would like to contribute or make issues, please do. I will be accepting everyone to help. Thank you for reading, and have a great day.",
    "April 24,2018" : "I am planning on working on a youtube channel and doing more art. But, I might just focus on my studies more. If I focus on my studies more, you will see important notes file filling up. It will have important notes, though. Just not much if I focus more on my hobbies.",
    "April 26,2018" : "I had two tests today. I need to do a git push and have nothing to put.",
    "April 27,2018" : "I'm probably a person with one of the plainest lives. I have nothing interesting, every single day.",
    "May 2,2018" : "Please add issues, thank you."
    "May 3,2018" :{
   "Javascript" : "drawbox doesn't seem to be a command, so I believe it is invalid."
  }
 }
}
